src/Reports/ОтчетПоПроизводственнымЗаданиямСводныйИстория/ОтчетПоПроизводственнымЗаданиямСводныйИстория.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоПроизводственнымЗаданиямСводныйИстория</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МТК</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЛьготнаяОчередь/ЛьготнаяОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготнаяОчередь</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЭтапыПроизводственныхЗаданий/ЭтапыПроизводственныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭтапыПроизводственныхЗаданий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтендовыйПрогон/СтендовыйПрогон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтендовыйПрогон</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Прогон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПоступление</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПостановка</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПостановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительСнятие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСнятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/БарКоды/БарКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БарКоды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыйБарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>MAC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодDanfoss</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомерEnLogic</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IDКлюча</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>BT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерИзделия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыРемонта/СтатусыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРемонта</name>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Окончен</name>
  </enumValues>
  <enumValues>
    <name>Разукомплектовка</name>
  </enumValues>
</mdclass:Enum>

src/Documents/РемонтнаяКарта/РемонтнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РемонтнаяКарта</name>
  <basedOn>Document.ПроизводственноеЗадание</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеремонтопригодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРемонта</name>
    <type>
      <types>CatalogRef.ПричиныРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоРазукомплектовки</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтложен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Неисправности</name>
    <attributes>
      <name>ПозицияНеисправногоМПЗ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеисправныйМПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияМестаНахожденияБрака</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоНахожденияБрака</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапЖизненногоЦикла</name>
      <type>
        <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидБрака</name>
      <type>
        <types>CatalogRef.ВидыБрака</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаменяемыеЭлементы</name>
    <attributes>
      <name>НормаРасхода</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДвижениеМПЗ</types>
        <types>DocumentRef.СписаниеМПЗПрочее</types>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разукомплектовка</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ОтчетПоПроизводственнымЗаданиямСводныйИстория/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьПоАРМНаСервере()
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет1");
 
ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");	
ОблШапкаРабочееМесто = Макет.ПолучитьОбласть("Шапка|РабочееМесто");
ОблШапкаСтенд = Макет.ПолучитьОбласть("Шапка|Стенд");
ОблШапкаРемонт = Макет.ПолучитьОбласть("Шапка|Ремонт");

ОблПЗОбщие = Макет.ПолучитьОбласть("ПЗ|Общие");	
ОблПЗРабочееМесто = Макет.ПолучитьОбласть("ПЗ|РабочееМесто");
ОблПЗСтенд = Макет.ПолучитьОбласть("ПЗ|Стенд");
ОблПЗРемонт = Макет.ПолучитьОбласть("ПЗ|Ремонт");
	
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");	
ОблКонецРабочееМесто = Макет.ПолучитьОбласть("Конец|РабочееМесто");
ОблКонецСтенд = Макет.ПолучитьОбласть("Конец|Стенд");
ОблКонецРемонт = Макет.ПолучитьОбласть("Конец|Ремонт");

ОблШапкаОбщие.Параметры.НаДату = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ОблШапкаОбщие.Параметры.Линейка = ""+Отчет.Линейка + " ("+Отчет.Линейка.Комментарий+")";
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого РМ Из СписокРМ Цикл
		Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
		ОблШапкаСтенд.Параметры.РабочееМесто = РМ.Значение;
		ТабДок.Присоединить(ОблШапкаСтенд);
		Иначе
		ОблШапкаРабочееМесто.Параметры.РабочееМесто = РМ.Значение;
		ТабДок.Присоединить(ОблШапкаРабочееМесто);
		КонецЕсли; 
	КонецЦикла;
		Если ПоказыватьРемонт Тогда
		ТабДок.Присоединить(ОблШапкаРемонт);
		КонецЕсли;

ЗапросЛО = Новый Запрос;
ЗапросЛО.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.ПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.ПЗ.ДатаЗапуска = ДАТАВРЕМЯ(1,1,1,0,0,0)";
РезультатЗапроса = ЗапросЛО.Выполнить();
ВыборкаЛО = РезультатЗапроса.Выбрать();

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданий.ПЗ КАК Ссылка,
	|	ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование КАК МТК,
	|	ЭтапыПроизводственныхЗаданий.Изделие.Товар КАК Товар,
	|	ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование.Номер КАК НомерМТК
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий КАК ЭтапыПроизводственныхЗаданий
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданий.РабочееМесто = &РабочееМесто
	|	И ЭтапыПроизводственныхЗаданий.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокНоменклатуры.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.ПЗ.Изделие В ИЕРАРХИИ(&СписокИзделий)";
	КонецЕсли;
		Если Не ПоказыватьРемонт Тогда
		Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование.Ремонт = ЛОЖЬ";
		КонецЕсли;  
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ЭтапыПроизводственныхЗаданий.ДатаОкончания";
Запрос.УстановитьПараметр("РабочееМесто",РабочееМесто);
Запрос.УстановитьПараметр("ДатаНач",Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон",Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокИзделий",СписокНоменклатуры);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
НомСтр = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НомСтр = НомСтр + 1;
	ОблПЗОбщие.Параметры.НомСтр = НомСтр;
		Если Не ВыборкаДетальныеЗаписи.Товар.Пустая() Тогда
		ОблПЗОбщие.Параметры.Спецификация = СокрЛП(ВыборкаДетальныеЗаписи.Товар.Наименование);
		Иначе
		ОблПЗОбщие.Параметры.Спецификация = СокрЛП(ВыборкаДетальныеЗаписи.МТК.Номенклатура.Наименование);
		КонецЕсли;
	СтатусРемонта = "";
	ПЗ = ВыборкаДетальныеЗаписи.Ссылка;				
    ОблПЗОбщие.Параметры.ПЗ = ПЗ;
	ОблПЗОбщие.Параметры.НомерПЗ = ПЗ.Номер;
	ОблПЗОбщие.Параметры.ВозвратнаяТара = СокрЛП(ПЗ.ВозвратнаяТара);
	ОблПЗОбщие.Параметры.БарКод = ПЗ.БарКод;
	ОблПЗОбщие.Параметры.КодDanfoss = ОбщийМодульВызовСервера.ПолучитьКодDanfoss(ПЗ.БарКод);
	ОблПЗОбщие.Параметры.Счёт = ПЗ.ДокументОснование.Счёт;
	ОблПЗОбщие.Параметры.ДатаОтгрузки = Формат(ПЗ.ДокументОснование.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
	ВыборкаЛО.Сбросить();
	СтуктураПоиска = Новый Структура("ПЗ",ПЗ);
		Если ВыборкаЛО.НайтиСледующий(СтуктураПоиска) Тогда
		ЛО = "ЛО";
		Иначе
		ЛО = "";
		КонецЕсли; 
	ОблПЗОбщие.Параметры.ЛО = ЛО;
	ТабДок.Вывести(ОблПЗОбщие);
	Отбор = Новый Структура("ПЗ",ПЗ);
		Для каждого РМ Из СписокРМ Цикл	
		ДатаНачала = "";
		ДатаОкончания = "";
			Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
			ТекПЗ = РегистрыСведений.СтендовыйПрогон.ПолучитьПоследнее(,Отбор);			
			ОблПЗСтенд.Параметры.ДатаНачала = ТекПЗ.ДатаПостановки;
			ОблПЗСтенд.Параметры.ДатаОкончания = ТекПЗ.ДатаСнятия;
			ОблПЗСтенд.Параметры.Прогон = ТекПЗ.Прогон;
			ТабДок.Присоединить(ОблПЗСтенд);
			Иначе
			ТекПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.Выбрать(,,Отбор);
				Пока ТекПЗ.Следующий() Цикл
					Если ТекПЗ.РабочееМесто = РМ.Значение Тогда
					ДатаНачала = ТекПЗ.ДатаНачала;
					ДатаОкончания = ТекПЗ.ДатаОкончания;
					Прервать;
					КонецЕсли; 
				КонецЦикла;
			ОблПЗРабочееМесто.Параметры.ДатаНачала = ДатаНачала;
			ОблПЗРабочееМесто.Параметры.ДатаОкончания = ДатаОкончания;
			ТабДок.Присоединить(ОблПЗРабочееМесто);
			КонецЕсли;			
		КонецЦикла;
			Если ПоказыватьРемонт Тогда
			ЗапросРемонт = Новый Запрос;
			СписокРемонтныхКарт = Новый СписокЗначений;

			ЗапросРемонт.Текст = 
				"ВЫБРАТЬ
				|	РемонтнаяКарта.Ссылка
				|ИЗ
				|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
				|ГДЕ
				|	РемонтнаяКарта.ДокументОснование = &ДокументОснование";			
			ЗапросРемонт.УстановитьПараметр("ДокументОснование", ПЗ);		
			РезультатЗапросаРемонт = ЗапросРемонт.Выполнить();
			ВыборкаРемонт = РезультатЗапросаРемонт.Выбрать();
				Пока ВыборкаРемонт.Следующий() Цикл
				СписокРемонтныхКарт.Добавить(ВыборкаРемонт.Ссылка);
					Если ВыборкаРемонт.Ссылка.Проведен Тогда
					СтатусРемонта =	"Завершён"; 					
					Иначе	
					СтатусРемонта =	"Ремонт"; 					
					КонецЕсли;
				КонецЦикла;
			ОблПЗРемонт.Параметры.СтатусРемонта = СтатусРемонта;
			ОблПЗРемонт.Параметры.СписокРемонтныхКарт = СписокРемонтныхКарт;
			ТабДок.Присоединить(ОблПЗРемонт);
			КонецЕсли;			
	КонецЦикла;		
ТабДок.Вывести(ОблКонецОбщие);
	Для каждого РМ Из СписокРМ Цикл
		Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
		ТабДок.Присоединить(ОблКонецСтенд);
		Иначе
		ТабДок.Присоединить(ОблКонецРабочееМесто);
		КонецЕсли;
	КонецЦикла;
		Если ПоказыватьРемонт Тогда
		ТабДок.Присоединить(ОблКонецРемонт);
		КонецЕсли;
ТабДок.ФиксацияСверху = 4;
ТабДок.ФиксацияСлева = 8;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
	Если СортировкаОтчёта = 3 Тогда
		Если РабочееМесто.Пустая() Тогда
		Сообщить("Выберите АРМ!");
		Возврат;
		КонецЕсли;
	СформироватьПоАРМНаСервере(); 
	Возврат;	
	КонецЕсли;
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
 
ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");	
ОблШапкаРабочееМесто = Макет.ПолучитьОбласть("Шапка|РабочееМесто");
ОблШапкаСтенд = Макет.ПолучитьОбласть("Шапка|Стенд");
ОблШапкаРемонт = Макет.ПолучитьОбласть("Шапка|Ремонт");
	
ОблМТКОбщие = Макет.ПолучитьОбласть("МТК|Общие");	
ОблМТКРабочееМесто = Макет.ПолучитьОбласть("МТК|РабочееМесто");
ОблМТКСтенд = Макет.ПолучитьОбласть("МТК|Стенд");
ОблМТКРемонт = Макет.ПолучитьОбласть("МТК|Ремонт");

ОблПЗОбщие = Макет.ПолучитьОбласть("ПЗ|Общие");	
ОблПЗРабочееМесто = Макет.ПолучитьОбласть("ПЗ|РабочееМесто");
ОблПЗСтенд = Макет.ПолучитьОбласть("ПЗ|Стенд");
ОблПЗРемонт = Макет.ПолучитьОбласть("ПЗ|Ремонт");
	
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");	
ОблКонецРабочееМесто = Макет.ПолучитьОбласть("Конец|РабочееМесто");
ОблКонецСтенд = Макет.ПолучитьОбласть("Конец|Стенд");
ОблКонецРемонт = Макет.ПолучитьОбласть("Конец|Ремонт");

ОблШапкаОбщие.Параметры.НаДату = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого РМ Из СписокРМ Цикл
		Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
		ОблШапкаСтенд.Параметры.РабочееМесто = РМ.Значение;
		ТабДок.Присоединить(ОблШапкаСтенд);
		Иначе
		ОблШапкаРабочееМесто.Параметры.РабочееМесто = РМ.Значение;
		ТабДок.Присоединить(ОблШапкаРабочееМесто);
		КонецЕсли; 
	КонецЦикла;
		Если ПоказыватьРемонт Тогда
		ТабДок.Присоединить(ОблШапкаРемонт);
		КонецЕсли;

ЗапросЛО = Новый Запрос;

ЗапросЛО.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.ПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.ПЗ.ДатаЗапуска = ДАТАВРЕМЯ(1,1,1,0,0,0)";
РезультатЗапроса = ЗапросЛО.Выполнить();
ВыборкаЛО = РезультатЗапроса.Выбрать();

Запрос = Новый Запрос;

	Если Не Отчет.МТК.Пустая() Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственноеЗадание.Ссылка,
		|	ПроизводственноеЗадание.ДокументОснование КАК МТК,
		|	ПроизводственноеЗадание.Изделие.Товар КАК Товар,
		|	ПроизводственноеЗадание.ДокументОснование.Номер КАК НомерМТК,
		|	ПроизводственноеЗадание.Изделие.Товар.Наименование КАК Наименование
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование";	
	Запрос.УстановитьПараметр("ДокументОснование",Отчет.МТК);
	ИначеЕсли ЗначениеЗаполнено(Отчет.БарКод) Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственноеЗадание.Ссылка,
		|	ПроизводственноеЗадание.ДокументОснование КАК МТК,
		|	ПроизводственноеЗадание.Изделие.Товар КАК Товар,
		|	ПроизводственноеЗадание.ДокументОснование.Номер КАК НомерМТК,
		|	ПроизводственноеЗадание.Изделие.Товар.Наименование КАК Наименование
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.БарКод = &БарКод";
 		Если СтрДлина(СокрЛП(Отчет.БарКод)) >= 17 Тогда
		Запрос.УстановитьПараметр("БарКод",Отчет.БарКод);		
		Иначе
		БарКод = ОбщийМодульВызовСервера.ПолучитьБарКодПоКодуDanfoss(Отчет.БарКод);
			Если ЗначениеЗаполнено(БарКод) Тогда
			Запрос.УстановитьПараметр("БарКод",БарКод);
			Иначе
			Сообщить("Не найдено соответствие бар-кода введённому коду Danfoss!");
			Возврат;
			КонецЕсли;		
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Счёт) Тогда
 	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственноеЗадание.Ссылка,
		|	ПроизводственноеЗадание.ДокументОснование КАК МТК,
		|	ПроизводственноеЗадание.Изделие.Товар КАК Товар,
		|	ПроизводственноеЗадание.ДокументОснование.Номер КАК НомерМТК,
		|	ПроизводственноеЗадание.Изделие.Товар.Наименование КАК Наименование
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.ДокументОснование.Счёт ПОДОБНО &Счёт";	
	Запрос.УстановитьПараметр("Счёт",Счёт+"%");	
	ИначеЕсли ВыборПериодаПо = 1 Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственноеЗадание.Ссылка,
		|	ПроизводственноеЗадание.ДокументОснование КАК МТК,
		|	ПроизводственноеЗадание.Изделие.Товар КАК Товар,
		|	ПроизводственноеЗадание.ДокументОснование.Номер КАК НомерМТК,
		|	ПроизводственноеЗадание.Изделие.Товар.Наименование КАК Наименование
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ПроизводственноеЗадание.Линейка = &Линейка";
		Если СписокНоменклатуры.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ПроизводственноеЗадание.Изделие В ИЕРАРХИИ(&СписокИзделий)";
		КонецЕсли; 
			Если Не ПоказыватьРемонт Тогда
			Запрос.Текст = Запрос.Текст + " И ПроизводственноеЗадание.ДокументОснование.Ремонт = ЛОЖЬ";
			КонецЕсли; 	
	Запрос.УстановитьПараметр("Линейка",Отчет.Линейка);
	Запрос.УстановитьПараметр("ДатаНач",Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Отчет.Период.ДатаОкончания);	
	Запрос.УстановитьПараметр("СписокИзделий",СписокНоменклатуры);
	Иначе
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроизводственныхЗаданий.ПЗ КАК Ссылка,
		|	ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование КАК МТК,
		|	ЭтапыПроизводственныхЗаданий.Изделие.Товар КАК Товар,
		|	ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование.Номер КАК НомерМТК,
		|	ЭтапыПроизводственныхЗаданий.Изделие.Товар.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.ЭтапыПроизводственныхЗаданий КАК ЭтапыПроизводственныхЗаданий
		|ГДЕ
		|	ЭтапыПроизводственныхЗаданий.РабочееМесто = &РабочееМесто
		|	И ЭтапыПроизводственныхЗаданий.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон";
		Если СписокНоменклатуры.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.ПЗ.Изделие В ИЕРАРХИИ(&СписокИзделий)";
		КонецЕсли;
			Если Не ПоказыватьРемонт Тогда
			Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование.Ремонт = ЛОЖЬ";
			КонецЕсли; 	
	Запрос.УстановитьПараметр("РабочееМесто",РабочееМесто);
	Запрос.УстановитьПараметр("ДатаНач",Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Отчет.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СписокИзделий",СписокНоменклатуры);
	КонецЕсли;
		Если СортировкаОтчёта = 1 Тогда
		Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО НомерМТК";
		Иначе
		Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Наименование";
		КонецЕсли; 
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
НомСтр = 0;
ТекМТК = Документы.МаршрутнаяКарта.ПустаяСсылка();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТекМТК <> ВыборкаДетальныеЗаписи.МТК Тогда
		ТекМТК = ВыборкаДетальныеЗаписи.МТК;
		ОблМТКОбщие.Параметры.Линейка = ВыборкаДетальныеЗаписи.МТК.Линейка;
		ОблМТКОбщие.Параметры.ЛинейкаКомм = ВыборкаДетальныеЗаписи.МТК.Линейка.Комментарий;
		ОблМТКОбщие.Параметры.МТК = ВыборкаДетальныеЗаписи.МТК;
		ОблМТКОбщие.Параметры.НомерМТК = ВыборкаДетальныеЗаписи.МТК.Номер;
			Если Не ВыборкаДетальныеЗаписи.Товар.Пустая() Тогда
			ОблМТКОбщие.Параметры.Спецификация = СокрЛП(ВыборкаДетальныеЗаписи.Товар.Наименование);
			Иначе
			ОблМТКОбщие.Параметры.Спецификация = СокрЛП(ВыборкаДетальныеЗаписи.МТК.Номенклатура.Наименование);
			КонецЕсли; 
				Если ВыборкаДетальныеЗаписи.МТК.Статус = 2 Тогда
				ОблМТКОбщие.Параметры.Остановка = "О";
				Иначе
				ОблМТКОбщие.Параметры.Остановка = "";
				КонецЕсли; 
		ТабДок.Вывести(ОблМТКОбщие);
			Для каждого РМ Из СписокРМ Цикл
				Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
				ТабДок.Присоединить(ОблМТКСтенд);
				Иначе
				ТабДок.Присоединить(ОблМТКРабочееМесто);
				КонецЕсли;
			КонецЦикла;
				Если ПоказыватьРемонт Тогда
				ТабДок.Присоединить(ОблМТКРемонт);
				КонецЕсли;
		КонецЕсли; 
	НомСтр = НомСтр + 1;
	ОблПЗОбщие.Параметры.НомСтр = НомСтр;
	СтатусРемонта = Перечисления.СтатусыРемонта.ПустаяСсылка();
	ПЗ = ВыборкаДетальныеЗаписи.Ссылка;				
    ОблПЗОбщие.Параметры.ПЗ = ПЗ;
	ОблПЗОбщие.Параметры.НомерПЗ = ПЗ.Номер;
	ОблПЗОбщие.Параметры.ВозвратнаяТара = СокрЛП(ПЗ.ВозвратнаяТара);
	ОблПЗОбщие.Параметры.БарКод = ПЗ.БарКод;
	ОблПЗОбщие.Параметры.КодDanfoss = ОбщийМодульВызовСервера.ПолучитьКодDanfoss(ПЗ.БарКод);
	ОблПЗОбщие.Параметры.Счёт = ПЗ.ДокументОснование.Счёт;
	ОблПЗОбщие.Параметры.ДатаОтгрузки = Формат(ПЗ.ДокументОснование.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
	ВыборкаЛО.Сбросить();
	СтуктураПоиска = Новый Структура("ПЗ",ПЗ);
		Если ВыборкаЛО.НайтиСледующий(СтуктураПоиска) Тогда
		ЛО = "ЛО";
		Иначе
		ЛО = "";
		КонецЕсли; 
	ОблПЗОбщие.Параметры.ЛО = ЛО;
	ТабДок.Вывести(ОблПЗОбщие);
	Отбор = Новый Структура("ПЗ",ПЗ);
		Для каждого РМ Из СписокРМ Цикл	
		ДатаНачала = "";
		ДатаОкончания = "";
			Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
			ТекПЗ = РегистрыСведений.СтендовыйПрогон.ПолучитьПоследнее(,Отбор);			
			ОблПЗСтенд.Параметры.ДатаНачала = ТекПЗ.ДатаПостановки;
			ОблПЗСтенд.Параметры.ДатаОкончания = ТекПЗ.ДатаСнятия;
			ОблПЗСтенд.Параметры.Прогон = ТекПЗ.Прогон;
			ТабДок.Присоединить(ОблПЗСтенд);
			Иначе
			ТекПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.Выбрать(,,Отбор);
				Пока ТекПЗ.Следующий() Цикл
					Если ТекПЗ.РабочееМесто = РМ.Значение Тогда
					ДатаНачала = ТекПЗ.ДатаНачала;
					ДатаОкончания = ТекПЗ.ДатаОкончания;
					Прервать;
					КонецЕсли; 
				КонецЦикла;
			ОблПЗРабочееМесто.Параметры.ДатаНачала = ДатаНачала;
			ОблПЗРабочееМесто.Параметры.ДатаОкончания = ДатаОкончания;
			ТабДок.Присоединить(ОблПЗРабочееМесто);
			КонецЕсли;			
		КонецЦикла;
			Если ПоказыватьРемонт Тогда
			ЗапросРемонт = Новый Запрос;
			СписокРемонтныхКарт = Новый СписокЗначений;

			ЗапросРемонт.Текст = 
				"ВЫБРАТЬ
				|	РемонтнаяКарта.Ссылка
				|ИЗ
				|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
				|ГДЕ
				|	РемонтнаяКарта.ДокументОснование = &ДокументОснование";			
			ЗапросРемонт.УстановитьПараметр("ДокументОснование", ПЗ);		
			РезультатЗапросаРемонт = ЗапросРемонт.Выполнить();
			ВыборкаРемонт = РезультатЗапросаРемонт.Выбрать();
				Пока ВыборкаРемонт.Следующий() Цикл
				СписокРемонтныхКарт.Добавить(ВыборкаРемонт.Ссылка);
					Если ВыборкаРемонт.Ссылка.Проведен Тогда
					СтатусРемонта =	"Завершён"; 					
					Иначе	
					СтатусРемонта =	"Ремонт"; 					
					КонецЕсли;
				КонецЦикла;
			ОблПЗРемонт.Параметры.СтатусРемонта = СтатусРемонта;
			ОблПЗРемонт.Параметры.СписокРемонтныхКарт = СписокРемонтныхКарт;
			ТабДок.Присоединить(ОблПЗРемонт);
			КонецЕсли;			
	КонецЦикла;		
ТабДок.Вывести(ОблКонецОбщие);
	Для каждого РМ Из СписокРМ Цикл
		Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
		ТабДок.Присоединить(ОблКонецСтенд);
		Иначе
		ТабДок.Присоединить(ОблКонецРабочееМесто);
		КонецЕсли;
	КонецЦикла;
		Если ПоказыватьРемонт Тогда
		ТабДок.Присоединить(ОблКонецРемонт);
		КонецЕсли;
ТабДок.ФиксацияСверху = 3;
ТабДок.ФиксацияСлева = 7;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
ПолучитьСписокРМ();
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокРМ()
	Если Не Отчет.МТК.Пустая() Тогда
	Линейка = Отчет.МТК.Линейка;
	ИначеЕсли ЗначениеЗаполнено(Отчет.БарКод) Тогда
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БарКоды.ПЗ.Линейка КАК Линейка
		|ИЗ
		|	РегистрСведений.БарКоды КАК БарКоды
		|ГДЕ
		|	БарКоды.БарКод = &БарКод
		|	И ТИПЗНАЧЕНИЯ(БарКоды.ПЗ) = ТИП(Документ.ПроизводственноеЗадание)";
	 		Если СтрДлина(СокрЛП(Отчет.БарКод)) >= 17 Тогда
			Запрос.УстановитьПараметр("БарКод",Отчет.БарКод);		
			Иначе
			БарКод = ОбщийМодульВызовСервера.ПолучитьБарКодПоКодуDanfoss(Отчет.БарКод);
				Если ЗначениеЗаполнено(БарКод) Тогда
				Запрос.УстановитьПараметр("БарКод",БарКод);
				Иначе
				Сообщить("Не найдено соответствие бар-кода введённому коду Danfoss!");
				Возврат;
				КонецЕсли;		
			КонецЕсли;
	Линейка = Справочники.Линейки.ПустаяСсылка();
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Линейка = ВыборкаДетальныеЗаписи.Линейка;
		КонецЦикла;
			Если Линейка.Пустая() Тогда
			Возврат;
			КонецЕсли; 
	Иначе
		Если Отчет.Линейка.Пустая() Тогда
		Возврат;
		КонецЕсли; 
	Линейка = Отчет.Линейка;
	КонецЕсли; 
СписокРМ.Очистить();
Запрос = Новый Запрос;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка,
	|	РабочиеМестаЛинеек.ПометкаУдаления,
	|	РабочиеМестаЛинеек.Код КАК Код,
	|	РабочиеМестаЛинеек.Линейка,
	|	РабочиеМестаЛинеек.Наименование
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка = &Линейка
	|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ
	|	И РабочиеМестаЛинеек.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
Запрос.УстановитьПараметр("Линейка", Линейка);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРМ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("СписокЗначений") Тогда
	СтандартнаяОбработка = Ложь;
		Если Расшифровка.Количество() > 1 Тогда
		РК = Расшифровка.ВыбратьЭлемент();
			Если РК <> Неопределено Тогда
			ОткрытьФорму("Документ.РемонтнаяКарта.Форма.ФормаДокумента",Новый Структура("Ключ",РК.Значение));
			КонецЕсли;
		ИначеЕсли Расшифровка.Количество() = 1 Тогда
		ОткрытьФорму("Документ.РемонтнаяКарта.Форма.ФормаДокумента",Новый Структура("Ключ",Расшифровка[0].Значение));
		КонецЕсли; 	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура БарКодПриИзменении(Элемент)
Отчет.МТК = "";
Счёт = "";
КонецПроцедуры

&НаКлиенте
Процедура МТКПриИзменении(Элемент)
Отчет.БарКод = "";
Счёт = "";
КонецПроцедуры

&НаКлиенте
Процедура СчётПриИзменении(Элемент)
Отчет.МТК = "";
Отчет.БарКод = "";
КонецПроцедуры

&НаКлиенте
Процедура СортировкаОтчётаПриИзменении(Элемент)
	Если СортировкаОтчёта = 3 Тогда
	Элементы.Группа1.Доступность = Ложь;
	Иначе
	Элементы.Группа1.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
СортировкаОтчётаПриИзменении(Неопределено);
КонецПроцедуры
